In [ ]:
import numpy as np
import pandas as pd

##### Re-Indexing & Altering labels

In [2]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}

In [3]:
df = pd.DataFrame(data, index=['a', 'b', 'c'])
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [4]:
df.reindex(['c', 'a', 'b'])

      Name  Age
c  Charlie   35
a    Alice   25
b      Bob   30

In [5]:
df.reindex(['c', 'a', 'b', 'p'])

      Name   Age
c  Charlie  35.0
a    Alice  25.0
b      Bob  30.0
p      NaN   NaN

In [6]:
df.reindex(['p', 'q', 'r'])

  Name  Age
p  NaN  NaN
q  NaN  NaN
r  NaN  NaN

In [7]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [8]:
df.reindex(columns=['Age', 'Name'])

   Age     Name
a   25    Alice
b   30      Bob
c   35  Charlie

In [9]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

##### Rename index and columns

In [10]:
df.rename(index={'a':'p', 'c':'q'}, columns={'Name':'First Name', 'Age':'Current Age'})

  First Name  Current Age
p      Alice           25
b        Bob           30
q    Charlie           35

In [11]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [12]:
# Directly Replace Index or Column Labels

df.index = ['X', 'Y', 'Z']
df.columns = ['PersonName', 'PersonAge']

In [13]:
df

  PersonName  PersonAge
X      Alice         25
Y        Bob         30
Z    Charlie         35

In [16]:
df.reset_index(inplace=True)

In [17]:
df

  index PersonName  PersonAge
0     X      Alice         25
1     Y        Bob         30
2     Z    Charlie         35

In [18]:
df.drop(columns=['index'], inplace=True)

In [19]:
df

  PersonName  PersonAge
0      Alice         25
1        Bob         30
2    Charlie         35

##### Pivoting

In [20]:
data = {
    "Date": ["2024-01-01", "2024-01-01", "2024-01-02", "2024-01-02"],
    "Product": ["Laptop", "Mouse", "Laptop", "Mouse"],
    "Sales": [1200, 100, 1300, 120],
}

df = pd.DataFrame(data)

In [21]:
df

         Date Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120

In [22]:
df.pivot(index="Date", columns="Product", values="Sales")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [23]:
df.pivot(index="Product", columns="Date", values="Sales")

Date     2024-01-01  2024-01-02
Product
Laptop         1200        1300
Mouse           100         120

In [24]:
df.pivot_table(index="Date", columns="Product", values="Sales")

Product     Laptop  Mouse
Date
2024-01-01  1200.0  100.0
2024-01-02  1300.0  120.0

In [25]:
df.pivot_table(index="Date", columns="Product", values="Sales", aggfunc="sum")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [26]:
data2 = {
    "Date": ["2024-01-01", "2024-01-01", "2024-01-02", "2024-01-02", "2024-01-01", "2024-01-02"],
    "Product": ["Laptop", "Mouse", "Laptop", "Mouse", "Laptop", "Mouse"],
    "Sales": [1200, 100, 1300, 120, 560, 320],
}

df2 = pd.DataFrame(data2)

In [27]:
df2

         Date Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120
4  2024-01-01  Laptop    560
5  2024-01-02   Mouse    320

In [28]:
df2.pivot_table(index="Date", columns="Product", values="Sales")

Product     Laptop  Mouse
Date
2024-01-01   880.0  100.0
2024-01-02  1300.0  220.0

In [29]:
df2.pivot_table(index="Date", columns="Product", values="Sales", aggfunc="mean")

Product     Laptop  Mouse
Date
2024-01-01   880.0  100.0
2024-01-02  1300.0  220.0

In [30]:
df2.pivot_table(index="Date", columns="Product", values="Sales", aggfunc="sum")

Product     Laptop  Mouse
Date
2024-01-01    1760    100
2024-01-02    1300    440

In [31]:
df_trans = pd.read_csv("transactions.csv")

In [32]:
df_trans

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       01/01/2022   759.037390        A
1             436    Alice Brown       01/01/2022  1096.181632        C
2             861    Alice Brown       02/01/2022  1158.623597        B
3             271     Bob Wilson       02/01/2022   859.027857      NaN
4             107     John Smith       02/01/2022   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       27/12/2023   761.082210        C
1046           78    Alice Brown       27/12/2023  1003.574745        B
1047          457  Charlie Davis       28/12/2023   832.511670        C
1048          878  Charlie Davis       28/12/2023   723.357978        B
1049            1     Bob Wilson       30/12/2023   721.611291        C

[1050 rows x 5 columns]

In [33]:
df_trans.pivot_table(index="category", columns="name", values="amount", aggfunc="mean")

name      Alice Brown   Bob Wilson  Charlie Davis   John Smith
category
A         1013.098322  1007.145509     978.734140  1016.928494
B          995.399100  1001.289501     989.217648  1022.436821
C          987.403818   982.914803    1028.884271   979.868461

In [34]:
pivot_tbl = df_trans.pivot_table(index="category", columns="name", values="amount", aggfunc="sum")

In [35]:
pivot_tbl

name        Alice Brown     Bob Wilson  Charlie Davis     John Smith
category
A          50654.916080   65464.458093   66553.921547   78303.494025
B          68682.537866   47060.606561   69245.235392   77705.198415
C         131324.707842  105171.883924  132726.070909  111705.004519

In [36]:
pivot_tbl["Alice Brown"].sum()

np.float64(250662.161788)

##### groupby() Function

In [37]:
data = {
    'Department': ['IT', 'IT', 'HR', 'HR', 'Finance', 'Finance'],
    'Employee': ['A', 'B', 'C', 'D', 'E', 'F'],
    'Salary': [60000, 65000, 50000, 52000, 70000, 71000]
}

df_hr = pd.DataFrame(data)

df_hr

  Department Employee  Salary
0         IT        A   60000
1         IT        B   65000
2         HR        C   50000
3         HR        D   52000
4    Finance        E   70000
5    Finance        F   71000

In [38]:
df_hr.groupby(by='Department')

In [39]:
df_hr.groupby(by='Department')['Salary']

In [40]:
df_hr.groupby(by='Department')['Salary'].mean()

Department
Finance    70500.0
HR         51000.0
IT         62500.0
Name: Salary, dtype: float64

In [41]:
df_hr.groupby(by=['Department', 'Employee'])['Salary'].mean()

Department  Employee
Finance     E           70000.0
            F           71000.0
HR          C           50000.0
            D           52000.0
IT          A           60000.0
            B           65000.0
Name: Salary, dtype: float64

In [ ]:
df_hr.groupby(by='Department')['Salary'].agg(['sum', 'mean', 'count'])

               sum     mean  count
Department
Finance     141000  70500.0      2
HR          102000  51000.0      2
IT          125000  62500.0      2

In [46]:
df_hr.groupby(by='Department')['Salary'].agg(Total_Sum='sum', Avg='mean', Count='count')

            Total_Sum      Avg  Count
Department
Finance        141000  70500.0      2
HR             102000  51000.0      2
IT             125000  62500.0      2

In [43]:
# Using groupby().apply() with custom function

df = pd.DataFrame({
    'Team': ['A', 'A', 'B', 'B', 'C', 'C'],
    'Player': ['P1', 'P2', 'P3', 'P4', 'P5', 'P6'],
    'Score': [15, 18, 10, 25, 20, 23]
})

In [44]:
df

  Team Player  Score
0    A     P1     15
1    A     P2     18
2    B     P3     10
3    B     P4     25
4    C     P5     20
5    C     P6     23

In [45]:
def score_diff(x):
    return x.max() - x.min()


ans = df.groupby('Team')['Score'].apply(score_diff)

ans

Team
A     3
B    15
C     3
Name: Score, dtype: int64

In [ ]:
# Filter groups with team total score > 35
total_score = df.groupby('Team')['Score'].sum()

high_score_teams = total_score[total_score > 35].index  # ['C']

filtered_df = df[df['Team'].isin(high_score_teams)]
filtered_df

  Team Player  Score
4    C     P5     20
5    C     P6     23

##### transform() function

In [55]:
df

  Team Player  Score
0    A     P1     15
1    A     P2     18
2    B     P3     10
3    B     P4     25
4    C     P5     20
5    C     P6     23

In [56]:
df['New_Score'] = df['Score'].transform(lambda x: x + 5)

In [57]:
df

  Team Player  Score  New_Score
0    A     P1     15         20
1    A     P2     18         23
2    B     P3     10         15
3    B     P4     25         30
4    C     P5     20         25
5    C     P6     23         28

In [58]:
df.drop(columns=['New_Score'], inplace=True)

In [59]:
df

  Team Player  Score
0    A     P1     15
1    A     P2     18
2    B     P3     10
3    B     P4     25
4    C     P5     20
5    C     P6     23

In [60]:
df['Avg_Score'] = df.groupby(by='Team')['Score'].transform('mean')

df

  Team Player  Score  Avg_Score
0    A     P1     15       16.5
1    A     P2     18       16.5
2    B     P3     10       17.5
3    B     P4     25       17.5
4    C     P5     20       21.5
5    C     P6     23       21.5